# PW Data Science Masters

## Assignment - 22

In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
d1 = pd.Series([4,8,15,16,23,42])
d1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

In [6]:
l = ['Welcome!', 'MY', 'Name', 'is', 'Prateek', 'Singh.', 'I', 'am', 'a', 'Data Scientist.']
pd.Series(l)

0           Welcome!
1                 MY
2               Name
3                 is
4            Prateek
5             Singh.
6                  I
7                 am
8                  a
9    Data Scientist.
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [7]:
d = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}
pd.DataFrame(d)

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans- A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

Pandas 'DataFrame' is differnet from Pandas 'Series':-

Pandas Series	                               vs         Pandas DataFrame

One-dimensional                               |   Two-dimensional 

Homogenous – Series elements must be of the same data type. |Heterogenous – DataFrame elements can have different data types.

In [8]:
#Example:-

data = {
  "calories": [420, 380, 390],
  "Sugar Level": [250, 340, 245]}
pd.DataFrame(data)

   calories  Sugar Level
0       420          250
1       380          340
2       390          245

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

Ans- Some common functions you can use to manipulate data in a Pandas DataFrame are:-

- unique and nunique function
- describe function
- sort_values function
- value_counts function
- isnull function to find NULL values
- fillna function to fill NULL values
- groupby function

In [10]:
d4 = pd.read_csv('Unemployment_Rate_upto_11_2020.csv')
d4.head()

,Region,Date,Frequency,Estimated Unemployment Rate (%),Estimated Employed,Estimated Labour Participation Rate (%),Region.1,longitude,latitude
0,Andhra Pradesh,31-01-2020,M,5.48,16635535,41.02,South,15.9129,79.74
1,Andhra Pradesh,29-02-2020,M,5.83,16545652,40.90,South,15.9129,79.74
2,Andhra Pradesh,31-03-2020,M,5.79,15881197,39.18,South,15.9129,79.74
3,Andhra Pradesh,30-04-2020,M,20.51,11336911,33.10,South,15.9129,79.74
4,Andhra Pradesh,31-05-2020,M,17.43,12988845,36.46,South,15.9129,79.74

In [11]:
d4.describe()

,Estimated Unemployment Rate (%),Estimated Employed,Estimated Labour Participation Rate (%),longitude,latitude
count,267.000000,2.670000e+02,267.000000,267.000000,267.000000
mean,12.236929,1.396211e+07,41.681573,22.826048,80.532425
std,10.803283,1.336632e+07,7.845419,6.270731,5.831738
min,0.500000,1.175420e+05,16.770000,10.850500,71.192400
25%,4.845000,2.838930e+06,37.265000,18.112400,76.085600
50%,9.650000,9.732417e+06,40.390000,23.610200,79.019300
75%,16.755000,2.187869e+07,44.055000,27.278400,85.279900
max,75.850000,5.943376e+07,69.690000,33.778200,92.937600

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans- THe DataFrame is mutable and provides great flexibility to work with.

Q7. Create a DataFrame using multiple Series. Explain with an example.

Ans- By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Using axis=0 appends series to rows instead of columns.

In [9]:
courses = pd.Series(["Data Scince Masters","Web Development","Artificial Intelligence"])
fees = pd.Series([7000,7000,7000])
discount  = pd.Series([3500,3500,4000])
df=pd.concat([courses,fees,discount],axis=1)
print(df)

                         0     1     2
0      Data Scince Masters  7000  3500
1          Web Development  7000  3500
2  Artificial Intelligence  7000  4000